{
  "dock_07": {
    "nome_location": "Cyber-Dock 07",
    "descrizione": "Le luci al neon si riflettono sulle pozzanghere oleose del molo. L'aria è densa di salsedine e del ronzio dei droni da carico. Un mercantile arrugginito, il 'CosmoDrifter', è ormeggiato, cigolando contro i respingenti. Cosa fai?",
    "path_immagine": "asset/metropolis.png",
    "azioni": {
      "a": "Ispeziona il mercantile",
      "b": "Parla con i portuali",
      "c": "Cerca terminale dati",
      "d": "Controlla le casse",
      "e": "Nasconditi nell'ombra",
      "f": "Scansiona le frequenze",
      "g": "Esamina le gru",
      "h": "Cerca un passaggio",
      "i": "Cerca compagnia"
    },
    "azioni_effetti": {
      "a": {
        "narrativa": "Sali a bordo del CosmoDrifter. Il ponte è deserto ma noti tracce di un'attività recente. Dei cavi di alimentazione sono stati staccati di fresco e c'è un odore di ozono nell'aria.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "b": {
        "narrativa": "Ti avvicini ai portuali che scaricano merci. Uno di loro, un cyborg con braccia meccaniche, ti guarda sospettoso: 'Che cosa vuoi, straniero? Questo non è posto per turisti.'",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "c": {
        "narrativa": "Individui un terminale dati semi-nascosto dietro alcune casse. Lo schermo mostra log di transazioni commerciali. Qualcuno ha cercato di cancellare i dati, ma non del tutto.",
        "richiede_flag": null,
        "imposta_flag": "dock_07_terminale_hackerato",
        "modifica_risorse": {"Chip Dati": 1}
      },
      "d": {
        "narrativa": "Frughi tra le casse ammucchiate. Nella terza cassa trovi un contenitore metallico con 200 crediti e alcuni componenti elettronici di valore!",
        "narrativa_ripetuta": "Controlli di nuovo le casse, ma sono ormai vuote. Hai già preso tutto quello che c'era di valore.",
        "richiede_flag": "!dock_07_casse_controllate",
        "imposta_flag": "dock_07_casse_controllate",
        "modifica_risorse": {"Crediti": 200, "Componenti": 3}
      },
      "e": {
        "narrativa": "Ti nascondi nell'ombra di una gru. Da qui osservi il movimento dei droni e noti uno schema interessante: ogni 15 minuti arriva un drone da una direzione specifica.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "f": {
        "narrativa": "Attivi lo scanner per le frequenze radio. Intercetti trasmissioni criptate tra i droni da carico. Potrebbe essere utile più avanti.",
        "richiede_flag": null,
        "imposta_flag": "dock_07_frequenze_scansionate",
        "modifica_risorse": null
      },
      "g": {
        "narrativa": "Esamini le gru portuali. Sono vecchie ma funzionanti. Noti che una di esse ha un pannello di controllo accessibile - potrebbe essere utile in futuro.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "h": {
        "narrativa": "Cerchi qualcuno disposto a farti viaggiare. Un contrabbandiere ti offre un passaggio per 100 crediti, ma non sembra molto affidabile.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "i": {
        "narrativa": "Decidi di osservare la situazione senza agire. Il tempo passa lentamente mentre ascolti i suoni del molo e osservi l'attività portuale.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      }
    },
    "descrizione_alternativa": {
      "dock_07_casse_controllate": "Le luci al neon si riflettono sulle pozzanghere oleose del molo. L'aria è densa di salsedine e del ronzio dei droni da carico. Un mercantile arrugginito, il 'CosmoDrifter', è ormeggiato, cigolando contro i respingenti. Le casse che hai già controllato sono ancora sparse per il molo."
    },
    "navigazione": {
      "N": "market_district",
      "S": null,
      "E": null,
      "W": null
    }
  },
  "market_district": {
    "nome_location": "Distretto del Mercato Nero",
    "descrizione": "Vicolo stretto e affollato, illuminato da ologrammi pubblicitari tremolanti. Mercanti di ogni tipo vendono impianti cibernetici, dati rubati e armi illegali. L'odore di spezie sintetiche e circuiti bruciati è opprimente.",
    "path_immagine": "https://cdn.pixabay.com/photo/2024/02/21/14/19/ai-generated-8587937_1280.png",
    "azioni": {
      "a": "Contratta per un chip",
      "b": "Origlia conversazioni",
      "c": "Bevi al bar",
      "d": "Vendi componenti",
      "e": "Cerca un contatto",
      "f": "Decripta un terminale",
      "g": "Inizia una rissa",
      "h": "Gioca d'azzardo",
      "i": "Riparare equip."
    },
    "azioni_effetti": {
      "a": {
        "narrativa": "Contratti con un mercante di chip neurali. Ti offre un chip di memoria espansa per 300 crediti, ma sembra sospettosamente economico.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": null
      },
      "b": {
        "narrativa": "Ti avvicini discretamente a un gruppo di mercanti che parlano di una spedizione segreta. Menzioni un carico di 'merce speciale' in arrivo domani.",
        "richiede_flag": null,
        "imposta_flag": "market_info_spedizione",
        "modifica_risorse": null
      },
      "c": {
        "narrativa": "Ordini un drink sintetico al bar. Il barista cyborg ti serve un liquido blu elettrico. Ha un sapore di metallo e energia, ma ti rinfresca.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": {"Crediti": -15}
      },
      "d": {
        "narrativa": "Vendi alcuni componenti a un mercante di rottami. Ti offre 50 crediti per pezzo, un prezzo onesto per questo tipo di merce.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": {"Crediti": 150, "Componenti": -3}
      },
      "e": {
        "narrativa": "Cerchi un informatore nella folla. Dopo un po' trovi un hacker che ti propone un lavoro: hackerare un database corporativo per 500 crediti.",
        "richiede_flag": null,
        "imposta_flag": "market_contatto_hacker",
        "modifica_risorse": null
      },
      "f": {
        "narrativa": "Trovi un terminale pubblico e tenti di decrittarlo. Dopo vari tentativi riesci ad accedere a informazioni sui movimenti delle pattuglie di sicurezza.",
        "richiede_flag": null,
        "imposta_flag": "market_terminale_hackerato",
        "modifica_risorse": {"Chip Dati": 2}
      },
      "g": {
        "narrativa": "Provochi deliberatamente una rissa con un mercante arrogante. La situazione degenera rapidamente, ma riesci a fuggire prima che arrivi la sicurezza.",
        "richiede_flag": null,
        "imposta_flag": "market_rissa_causata",
        "modifica_risorse": null
      },
      "h": {
        "narrativa": "Giochi d'azzardo con alcuni contrabbandieri. La fortuna ti sorride e vinci una discreta somma, ma attiri anche attenzioni indesiderate.",
        "narrativa_ripetuta": "Provi a giocare di nuovo, ma stavolta la fortuna non è dalla tua parte. I contrabbandieri ti guardano con sospetto - sanno che hai già vinto abbastanza.",
        "richiede_flag": "!market_fortuna_esaurita",
        "imposta_flag": "market_fortuna_esaurita",
        "modifica_risorse": {"Crediti": 180}
      },
      "i": {
        "narrativa": "Ripari alcuni dei tuoi equipaggiamenti usurati. Usi i componenti di scorta per sistemare il tuo scanner e migliorare l'efficienza energetica.",
        "richiede_flag": null,
        "imposta_flag": null,
        "modifica_risorse": {"Componenti": -2}
      }
    },
    "descrizione_alternativa": {
      "market_rissa_causata": "Il vicolo del mercato nero è ancora in subbuglio dopo la rissa di prima. Alcuni mercanti ti guardano con sospetto, mentre altri sembrano rispettarti di più.",
      "market_fortuna_esaurita": "Il mercato nero è come sempre, ma ora i giocatori d'azzardo ti conoscono. La tua fortuna precedente è già leggenda, ma difficilmente si ripeterà."
    },
    "navigazione": {
      "N": null,
      "S": "dock_07",
      "E": null,
      "W": null
    }
  }
}